---
type: ConnectorSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ConnectorSet

`Autodesk.Revit.DB.ConnectorSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ConnectorSet | — | `public ConnectorSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( Connector item )` |
| Method | Erase | — | `public virtual int Erase ( Connector item )` |
| Method | ForwardIterator | — | `public virtual ConnectorSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( Connector item )` |
| Method | ReverseIterator | — | `public virtual ConnectorSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |